Autodesk.Revit.DB.Electrical.AnalyticalPowerSourceData.ApparentPowerRating
The apparent power rating value of the analytical power source.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for rating is not a number
-or-
When setting this property: The given value for rating is not finite
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for rating must be non-negative.
Since:
2025

Autodesk.Revit.DB.Electrical.AnalyticalPowerSourceData.Voltage
The voltage value of the analytical power source.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for voltage is not a number
-or-
When setting this property: The given value for voltage is not finite
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for voltage must be positive.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The voltage on the analytical node is not editable.
Since:
2023